export default [
  {
    name: '第一签',
    qianXiang: { //签像
      xiongJi: '中签灵签',//凶吉
      dianGu: '子牙弃官',//典故
      qianShi: `
      宛如仙鹤出凡笼 脱得凡笼路路通 <br />
      南北东西无阻隔 任君直上九霄宫
      `,//签诗
      shiYi: '此卦仙鹤离笼之象，凡事先凶后吉也'//诗意
    },
    dianGu: {
      title: '子牙弃官', //标题
      detail: `
      (封神传)商朝纣王时。 <br />
      姜子牙。一无所成。样样失败。 <br />
      时已七十二岁。火烧琵琶精后。获司天监职。官拜下大夫。纣王建鹿 台。子牙写了休书。 独自往西岐去。在渭水钓鱼。等待 时机。` //内容
    },
    yunChen: {
      jieYue: `
      任意无虑 路有亨通 <br />
      随心所欲 逍遥如人`, //解曰
      xianJi: `家宅不安 失物东南 婚姻合 寻人阻 自身还愿 疾病殁送 六甲男 移徙吉 田蚕秋利 求财合行人见 山坟吉 ` //仙机
    }
  },
  {
    name: '第二签',
    qianXiang: { //签像
      xiongJi: '中签灵签',//凶吉
      dianGu: '子牙弃官',//典故
      qianShi: `
      宛如仙鹤出凡笼 脱得凡笼路路通 <br />
      南北东西无阻隔 任君直上九霄宫
      `,//签诗
      shiYi: '此卦仙鹤离笼之象，凡事先凶后吉也'//诗意
    },
    dianGu: {
      title: '子牙弃官', //标题
      detail: `
      (封神传)商朝纣王时。 <br />
      姜子牙。一无所成。样样失败。 <br />
      时已七十二岁。火烧琵琶精后。获司天监职。官拜下大夫。纣王建鹿 台。子牙写了休书。 独自往西岐去。在渭水钓鱼。等待时机。` //内容
    },
    yunChen: {
      jieYue: `
      任意无虑 路有亨通<br />
      随心所欲 逍遥如人`, //解曰
      xianJi: `家宅不安 失物东南 婚姻合 寻人阻 自身还愿 疾病殁送 六甲男 移徙吉 田蚕秋利 求财合行人见 山坟吉 ` //仙机
    }
  }
]
