export default [
  {
    name: '第一签',
    qianXiang: { //签像
      xiongJi: '上签子宫',//凶吉
      dianGu: '钟离成道',//典故
      qianShi: `
      开天辟地作良缘 吉日良时万物全</br>
      若得此签非小可 人行忠正帝王宣
      `,//签诗
      shiYi: '此卦盘古初开天地之象，诸事皆吉也'//诗意
    },
    dianGu: {
      title: '钟离成道', //标题
      detail: `东汉时人姓锺离。名权字云房。号正阳。陕西西安咸阳县，仕汉将军，每出兵俱为先锋至五十岁免不得杀人三十余万。北征吐番。兵二万。嬴弱士卒。利尽散。独骑逃至山谷。胡僧引入终南山凝阳洞。人生荣辱得失。辞官修道。东华帝君授仙法。遂隐晋州羊角山。汉武帝时。次礼聘不出。朝廷每有大事。往咨询。称山中宰相。吕洞宾之师。八仙之首。正阳派之开山祖师。称为正阳帝君。后皇帝封为太极左右宫真人` //内容
    },
    yunChen: {
      jieYue: `
      急速兆速 年未值时  <br />
      观音降笔 先报君知`, //解曰
      xianJi: `家宅不安 失物东南 婚姻合 寻人阻  <br />
      自身还愿 疾病殁送 六甲男 移徙吉 田蚕秋利  <br />
      求财合行人见 山坟吉 ` //仙机
    }
  },
  {
    name: '第二签',
    qianXiang: { //签像
      xiongJi: '下签子宫',//凶吉
      dianGu: '苏秦不第',//典故
      qianShi: `
      鲸鱼未变守江河 不可升腾更望高 <br />
      异日峥嵘身变化 许君一跃跳龙门
      `,//签诗
      shiYi: '此卦鲸鱼未变之象，凡事忍耐待时也'//诗意
    },
    dianGu: {
      title: '苏秦不第', //标题
      detail: `苏秦。战国东周洛阳人。师鬼谷子。游说秦王。书十二上其说。不行。裘敝金尽。憔悴而归。至家妻不下(织)机。(不理睬其夫)嫂不为炊。(不煮饭给其叔)秦惭怒。得太公阴符。发愤苦读。困怠时用锥刺股。痛而再读。后以合从(纵)之说。联六国抗秦。说赵竟佩六国相印。` //内容
    },
    yunChen: {
      jieYue: `
      得忍且忍 得耐且耐 <br />
      须待时至 功名还在`, //解曰
      xianJi: `家宅不安　行人平安　婚姻难　公讼和 <br />
      自身还愿　六畜不利　田蚕吉　移徙去 <br />
      求财欠利　失物东南　寻人见　山坟吉 <br />
      六甲作福　疾病祈保 ` //仙机
    }
  },
  {
    name: '第三签',
    qianXiang: { //签像
      xiongJi: '下签子宫',//凶吉
      dianGu: '董永遇仙',//典故
      qianShi: `
      临风冒雨去还乡 正是其身似燕儿 <br />
      衔得坭来欲作垒 到头垒坏复须坭
      `,//签诗
      shiYi: '此卦燕子衔坭之象，凡事劳心费力也'//诗意
    },
    dianGu: {
      title: '董永遇仙', //标题
      detail: `汉。董永。千乘人。少失母。独养父。流寓孝感。父亡无以葬。乃从人贷钱一万。日后无钱还。当以身作奴。葬毕。皇天见其孝行。即差仙女下凡为婚。董永道遇一妇人。求为永妻。永与俱诘。钱主令织缣(锦)三百疋以偿。一月而毕。辞永去。乃曰。我系天上织女。缘君至孝。玉帝令我助君偿债。言讫。凌空而去。敕封进宝状元。仙姬曰。天赐儿子三岁送还。(仙女回天)。后其子十六岁中状元。衣锦还乡。` //内容
    },
    yunChen: {
      jieYue: `
      千般用计 晨昏不停 <br />
      谁知此事 到底劳心`, //解曰
      xianJi: `家宅先凶后吉　公讼有理　蚕畜利　失物见<br />
      自身谨防　求财有　寻人见　交易成<br />
      疾病还愿　六甲男　移徙安　山坟吉<br />
      婚姻不合　行人吉 ` //仙机
    }
  },
  {
    name: '第四签',
    qianXiang: { //签像
      xiongJi: '上签子宫',//凶吉
      dianGu: '玉莲会十朋',//典故
      qianShi: `
      千年古镜复重圆 女再求夫男再婚 <br />
      自此门庭重改换 更添福禄在儿孙
      `,//签诗
      shiYi: '此卦古镜重圆之象 凡事劳心有贵也'//诗意
    },
    dianGu: {
      title: '玉莲会十朋', //标题
      detail: `荆录记。宋朝。王十朋少时家贫，与钱玉莲结婚。十朋上京赴考。孙汝权逼玉莲相嫁。玉莲投河自杀获救。十朋中状元。拒娶丞相之女为妻。二人几经波折。夫妻始复团圆。` //内容
    },
    yunChen: {
      jieYue: `
      淘沙见金 骑龙踏虎  <br />
      虽是劳心 于中有补`, //解曰
      xianJi: `自身秋冬旺　田蚕可养　失物迟见　行人至<br />
      求财秋冬旺　六畜可养　疾病祈福　寻人见<br />
      家宅欠利　公讼不利　交易允　山坟吉<br />
      六甲祈保　移徙守旧　婚姻成 ` //仙机
    }
  },
  {
    name: '第五签',
    qianXiang: { //签像
      xiongJi: '中签丑宫',//凶吉
      dianGu: '刘晨遇仙',//典故
      qianShi: `
      一锥凿地要求泉 努力求之得最难 <br />
      无意偶然遇知己 相逢携手上青天
      `,//签诗
      shiYi: '此卦锥地求泉之象 凡事先难后易也'//诗意
    },
    dianGu: {
      title: '刘晨遇仙', //标题
      detail: `东汉永平年间。刘晨和阮肇国二人入天台山采药。遇二仙女。招至成亲。半年后二人回家。方知子孙已过七世了，时已过百年。无人认识二人。二人返山找仙女。终找不到原路。喻有心花开花不发。无心插柳柳成荫。` //内容
    },
    yunChen: {
      jieYue: `
      欲望心事 西方可求   <br />
      不如莫动 立地可谋`, //解曰
      xianJi: `田蚕宜早种　疾病禳星　婚姻合　寻人见<br />
      家宅祈福　自身利　六甲安　移徙吉<br />
      公讼宜和　求财利　行人迟　山坟吉<br />
      失物不见　交易合　六畜损 ` //仙机
    }
  },
  {
    name: '第六签',
    qianXiang: { //签像
      xiongJi: '中签丑宫',//凶吉
      dianGu: '仁贵遇主',//典故
      qianShi: `
      投身岩下铜鸟居 须是还他大丈夫 <br />
      拾得营谋谁可得 通行天地此人无
      `,//签诗
      shiYi: '此卦投岩铜(雕)鸟之象 凡事宜顺吉之兆'//诗意
    },
    dianGu: {
      title: '仁贵遇主', //标题
      detail: `唐朝。薛仁贵三次投军。不得志。只任伙头。打仗有功也被他人冒领。唐太宗(李世民)被盖苏追杀。危急之中。得仁贵救。即被唐太宗封为元帅。后为征东大将军带兵东征。累立战功。` //内容
    },
    yunChen: {
      jieYue: `
      食用无余 身清喜贫    <br />
      待时利乐 权与概人`, //解曰
      xianJi: `家宅不利　田蚕早种　六甲安　移徙吉<br />
      自身中吉　疾病殁送　行人近　失物见<br />
      求财中吉　公讼有理　六畜损　山坟吉<br />
      婚姻平平　交易难　寻人见　` //仙机
    }
  },
  {
    name: '第七签',
    qianXiang: { //签像
      xiongJi: '下签丑宫',//凶吉
      dianGu: '苏娘走难',//典故
      qianShi: `
      奔波阻隔重重险 带水拖坭去度山 <br />
      更望他乡求用事 千乡万里未回还
      `,//签诗
      shiYi: '此卦拖坭带水之象 凡事守旧则吉也'//诗意
    },
    dianGu: {
      title: '苏娘走难', //标题
      detail: `苏娘走难。周朝景王时。皇后苏英。善与鹦鹉对话。获帝赞赏。西宫梅玉春妒嫉，陷害苏英。潘葛之妻代后受刑。娘娘逃至白马寺。腹痛产下太子。喻谁无逆境。随遇而安可也。` //内容
    },
    yunChen: {
      jieYue: `
      退身可得 进步为难     <br />
      只宜守旧 莫望高扳`, //解曰
      xianJi: `求财秋冬吉　婚姻祈福　失物不见　寻人难<br />
      家宅不利　六甲祈福　疾病作福　公讼亏<br />
      自身祈福　田蚕不利　山坟不利　移徙吉<br />
      交易平平　六畜不利　行人阻　` //仙机
    }
  },
  {
    name: '第八签',
    qianXiang: { //签像
      xiongJi: '上签丑宫',//凶吉
      dianGu: '斐度还带',//典故
      qianShi: `
      茂林松柏正兴旺 雨雪风霜总莫为 <br />
      异日忽然成大用 功名成就栋梁材
      `,//签诗
      shiYi: '此卦此卦松柏茂林之象 凡事有贵气也'//诗意
    },
    dianGu: {
      title: '斐度还带', //标题
      detail: `斐度是唐朝宪宗皇帝的宰相，在年轻时，斐度家境贫困。一日到香山寺拜佛，在地上拾到价值连城的玉带数条，寻访物主，终得归还。以此积德，反得高官厚禄，富贵荣华。后考中进士，任宰相，督师破蔡州，平潍西。晚年辞官居洛阳。` //内容
    },
    yunChen: {
      jieYue: `
      路上亨通 终身有功      <br />
      田蚕丰熟 家道兴隆`, //解曰
      xianJi: `自身顺利　家宅吉　田蚕利　失物见 <br />
      求财中平　交易旺　六畜损　疾病安 <br />
      行人有信　婚姻成　寻人至　山坟吉 <br />
      公讼有理　六甲男　移徙吉` //仙机
    }
  },
  {
    name: '第九签',
    qianXiang: { //签像
      xiongJi: '中签寅宫',//凶吉
      dianGu: '孔明点将',//典故
      qianShi: `
      烦君勿作私心事 此意偏宜说问公 <br />
      一片明心光皎洁 宛如皎月正天心
      `,//签诗
      shiYi: '此卦皎月当空之象 凡事光明通达也'//诗意
    },
    dianGu: {
      title: '孔明点将', //标题
      detail: `三国时。诸葛亮。字孔明。琅琊人。汉末避居南阳。研究奇门遁法。天文术数。卦算韬略。无所不精。刘备三顾草庐。出任军师。曹操大将夏侯敦领兵来攻。孔明升帐。调兵点将。关公张飞都不服气。在博望坡击败曹军。刘备军队大获全胜，关张从此信服。先主即位。拜丞相。受以托孤。后主封为武卿侯。` //内容
    },
    yunChen: {
      jieYue: `
      心中正直 理顺法宽       <br />
      圣无私语 终有分明`, //解曰
      xianJi: `求财中平　自身顺　行人动　寻人至<br />
      公讼有理　交易旺　田蚕利　疾病安<br />
      失物祈福　婚姻成　六畜损　山坟吉<br />
      家宅吉　六甲男` //仙机
    }
  },
  {
    name: '第十签',
    qianXiang: { //签像
      xiongJi: '中签寅宫',//凶吉
      dianGu: '庞涓观阵',//典故
      qianShi: `
      石藏无价玉和珍 只管他乡外客寻<br />
      宛如持灯更觅火 不如收拾枉劳心
      `,//签诗
      shiYi: '此卦持灯觅火之象 凡事待时成就也'//诗意
    },
    dianGu: {
      title: '庞涓观阵', //标题
      detail: `庞涓，战国。孙膑齐人。庞涓魏人。同师事鬼谷子。孙膑之学优于庞涓。涓为魏将。与膑斗智。输而忌之。乃以计刖其足。后孙膑假作颠狂。得脱归。齐威王以膑为师。将兵伐魏。庞涓至营地观阵。认得是孙膑颠倒八门阵。但破不了。孙膑用减灶添兵之法。赚庞涓。追至马陵道。伏弩射死。` //内容
    },
    yunChen: {
      jieYue: `
      姻缘会遇 何事不成       <br />
      须无限意 眼前是真`, //解曰
      xianJi: `家宅欠利　失物难见　求财难　行人动<br />
      田蚕秋吉　疾病殁送　交易难　寻人见<br />
      六畜难养　山坟中平　婚姻合　公讼亏<br />
      移徙旧安　自身安　六甲女` //仙机
    }
  },
  {
    name: '第十一签',
    qianXiang: { //签像
      xiongJi: '上签寅宫',//凶吉
      dianGu: '书荐姜维',//典故
      qianShi: `
      欲求胜事可非常 争奈亲姻日暂忙<br />
      到头竟必成鹿箭 贵人指引贵人乡
      `,//签诗
      shiYi: '此卦因祸得福之象 凡事营谋吉利也'//诗意
    },
    dianGu: {
      title: '书荐姜维', //标题
      detail: `三国时。姜维原为魏国战将。被孔明收服。姜维智勇双全。得孔明器重。孔明带兵六出祁山。病重命危。将己所著兵书二十四篇。计十万四千一百一十二字。内有八务七戒六恐五惧之法传授给大将军姜维。望其秉承遗志。` //内容
    },
    yunChen: {
      jieYue: `
      有意兴变 到底安然        <br />
      若问用事 只近贵人`, //解曰
      xianJi: `家宅大吉　六畜中平　求财有　寻人见<br />
      自身顺利　公讼有理　交易成　移徙旺<br />
      行人未至　失物东方　婚姻合　山坟吉<br />
      田蚕中平　疾病禳星　六甲男` //仙机
    }
  },
  {
    name: '第十二签',
    qianXiang: { //签像
      xiongJi: '上签寅宫',//凶吉
      dianGu: '武吉遇师',//典故
      qianShi: `
      否去泰来咫尺间 暂交君子出于山<br />
      若逢虎兔佳音信 立志忙中事即闲
      `,//签诗
      shiYi: '此卦祸中有福之象 凡事先凶后吉也'//诗意
    },
    dianGu: {
      title: '武吉遇师', //标题
      detail: `武吉本是樵夫。姜子牙钓于磻溪。二人相遇。见子牙用直钩钓鱼大笑。子牙看武吉气息断曰。今日入城打死人。武吉怒别。担柴入城。误触王相致死。文王画地为牢。武吉后被暂释。照顾老母至秋后正法。老母令其找姜子牙求救。太公收其为徒。授兵法。又令其挖坑施咒破解先天数。秋后不见武吉伏刑。文王演先天数。以为武吉已畏罪自杀。后文王碰见武吉。武吉引文王见姜太公。受封武德将军。师徒二人为文王效力。` //内容
    },
    yunChen: {
      jieYue: `
      换麻得丝 击人双足         <br />
      要见分明 因灾得福`, //解曰
      xianJi: `交易宜迟　疾病秋吉　婚姻成　移徙守<br />
      行人未回　家宅安　六甲男　失物见<br />
      六畜慎吉　自身吉　田蚕利　山坟吉<br />
      寻人有信　求财有　公讼吉` //仙机
    }
  },
  {
    name: '第十三签',
    qianXiang: { //签像
      xiongJi: '中签寅宫',//凶吉
      dianGu: '罗通拜帅',//典故
      qianShi: `
      自小生在富贵家 眼前万物总奢华<br />
      蒙君赐紫金玉带 四海声名定可夸
      `,//签诗
      shiYi: '此卦龙门得遇之象 凡事有变大吉也'//诗意
    },
    dianGu: {
      title: '罗通拜帅', //标题
      detail: `唐初。罗通十七岁。于校场比武获帅印。领兵北伐扫敌。后触怒唐太宗被免官。获程咬金求情得宽赦。喻少年得志。有成语曰。罗通扫北。` //内容
    },
    yunChen: {
      jieYue: `
      囚人逢赦 病即安然          <br />
      龙门得遇 名遍皇都`, //解曰
      xianJi: `家宅祈福　行人祈保　移徙守旧　寻人见<br />
      自身祈福　田蚕中平　失物东方　疾病安<br />
      求财冬吉　六畜中平　婚姻合　山坟吉<br />
      交易宜迟　公讼有理　六甲女` //仙机
    }
  },
  {
    name: '第十四签',
    qianXiang: { //签像
      xiongJi: '中签卯宫',//凶吉
      dianGu: '子牙弃官',//典故
      qianShi: `
      宛如仙鹤出樊笼 脱得樊笼路路通<br />
      南北东西无阻隔 任君直上九霄宫
      `,//签诗
      shiYi: '此卦仙鹤离笼之象 凡事先凶后吉也'//诗意
    },
    dianGu: {
      title: '子牙弃官', //标题
      detail: `子牙弃官。(封神传)商朝纣王时。姜子牙。一无所成。样样失败。时已七十二岁。火烧琵琶精后。获司天监职。官拜下大夫。纣王建鹿台。子牙谏王免劳民伤财。不果。逃回宋异人庄(宋家庄)上。欲与妻马氏离朝歌(首府)往西岐(文王首府)。其妻不肯。子牙写了休书。独自往西岐去。在渭水钓鱼。等待时机。` //内容
    },
    yunChen: {
      jieYue: `
      任意无虑 路有亨通           <br />
      随心所欲 逍遥如人`, //解曰
      xianJi: `家宅不安　失物东南　婚姻合　寻人阻<br />
      自身还愿　疾病殁送　六甲男　移徙吉<br />
      田蚕秋利　求财合　行人见　山坟吉<br />
      公讼宜和　交易合　六畜损` //仙机
    }
  },
  {
    name: '第十五签',
    qianXiang: { //签像
      xiongJi: '中签卯宫',//凶吉
      dianGu: '苏秦得志',//典故
      qianShi: `
      行人怨日气难吞 忽有灾事勿近前<br />
      鸟破林巢无所宿 可寻深处稳安身
      `,//签诗
      shiYi: '此卦鸟鹊离林之象 凡事到底应心也'//诗意
    },
    dianGu: {
      title: '苏秦得志', //标题
      detail: `战国。苏秦。洛阳人。师鬼谷子。游说秦王。书十二上其说。不行。裘敝金尽。憔悴而归。至家妻不下织机(不理睬其夫)。嫂不为炊(不煮饭给其叔)。秦惭怒。得太公阴符。发愤苦读。困怠时用锥刺股。痛而再读。再出谋事。以合从(合纵)之说。联六国抗秦。说赵竟佩六国相印。` //内容
    },
    yunChen: {
      jieYue: `
      任意无虑 路有亨通           <br />
      随心所欲 逍遥如人`, //解曰
      xianJi: `家宅不安　失物东南　婚姻合　寻人阻<br />
      自身还愿　疾病殁送　六甲男　移徙吉<br />
      田蚕秋利　求财合　行人见　山坟吉<br />
      公讼宜和　交易合　六畜损` //仙机
    }
  },
  {
    name: '第十六签',
    qianXiang: { //签像
      xiongJi: '中签卯宫',//凶吉
      dianGu: '叶梦熊朝帝',//典故
      qianShi: `
      愁眉思虑暂时开 启出云霄喜自来<br />
      宛如粪土中藏玉 良工荐举出尘埃
      `,//签诗
      shiYi: '此卦阴阳和合之象 凡所谋皆吉也'//诗意
    },
    dianGu: {
      title: '叶梦熊朝帝', //标题
      detail: `明朝。叶梦熊嘉靖年进士。为人有胆识。忠贞爱国。万历年间。边疆地带有寇作乱。可未有将领敢前往平乱。叶上朝晋见神宗皇帝。求领兵讨伐边寇。为国效力。` //内容
    },
    yunChen: {
      jieYue: `
      得处无失 损中有益 <br />
      小人逢凶 君子顺吉`, //解曰
      xianJi: `自身秋冬吉　公讼不利　交易成　寻人见<br />
      家宅不利　移徙守旧　婚姻成　失物阻<br />
      六甲虚惊　疾病作福　行人至　山坟安<br />
      田蚕祈福　求财成　六畜平　` //仙机
    }
  },
  {
    name: '第十七签',
    qianXiang: { //签像
      xiongJi: '中签卯宫',//凶吉
      dianGu: '话梅止渴',//典故
      qianShi: `
      莫听闲言说是非 晨昏只好念弥陀<br />
      若将狂话为真实 画饼如何止得饥
      `,//签诗
      shiYi: '此卦画饼充饥之象 诸事多虚少实也'//诗意
    },
    dianGu: {
      title: '话梅止渴', //标题
      detail: `三国。曹操领兵。败季缺水。兵卒口渴。曹曰前有一默林。到那当可吃梅解渴。兵卒听了口水直流。便不觉得口渴。望梅止渴出此典故。与画饼充饥同一意。` //内容
    },
    yunChen: {
      jieYue: `
      心中不定 枉看经文  <br />
      恰似画饼 食也难吞`, //解曰
      xianJi: `家宅祈福　六畜不利　疾病还愿　行人迟<br />
      自身顺利　公讼宜和　交易慢　寻人见<br />
      求财顺利　移徙守旧　婚姻阻　山坟吉<br />
      田蚕宜早　失物不见　六甲安　` //仙机
    }
  },
  {
    name: '第十八签',
    qianXiang: { //签像
      xiongJi: '上签卯宫',//凶吉
      dianGu: '曹国舅为仙',//典故
      qianShi: `
      金乌西坠兔东升 日夜循环至古今<br />
      僧道得知无不利 士农工商各从心
      `,//签诗
      shiYi: '此卦阴阳消长之象 凡事遂意之兆也'//诗意
    },
    dianGu: {
      title: '曹国舅为仙', //标题
      detail: `八仙之一。宋朝曹太后之弟。不守王法。后感耻辱。于是散尽家财。周济穷人，入终南山修道。遇钟离权及吕洞宾。引入仙班。手持玉箫为其标志。` //内容
    },
    yunChen: {
      jieYue: `
      心中无事 所作有功   <br />
      如弓上箭 一发当空`, //解曰
      xianJi: `田蚕早种　疾病拜送　求财顺　行人至<br />
      六畜欠利　山坟大吉　交易成　寻人至<br />
      公讼有理　家宅安　婚姻合　移徙吉<br />
      失物迟见　自身吉　六甲男　` //仙机
    }
  },
  {
    name: '第十九签',
    qianXiang: { //签像
      xiongJi: '中签辰宫',//凶吉
      dianGu: '子仪封王',//典故
      qianShi: `
      急水滩头放船归 风波作浪欲何为<br />
      若要安然求稳静 等待浪静道此危
      `,//签诗
      shiYi: '此卦船行急滩之象 凡事守旧待时也'//诗意
    },
    dianGu: {
      title: '子仪封王', //标题
      detail: `子仪唐朝大将军。平安禄山和史思明之乱。历七帝。唐肃宗拜为大元帅。封为汾阳郡王。刚八十岁。知有敌侵犯。郭子仪即披挂上阵。建中二年郭子仪八十五岁因病寿终正寝。` //内容
    },
    yunChen: {
      jieYue: `
      急水下船 险处待时    <br />
      若问营谋 尽可施为`, //解曰
      xianJi: `家宅作福　婚姻不就　疾病祈福　寻人难<br />
      自身作福　六甲虚惊　行人至　公讼和<br />
      求财未成　移徙守旧　田蚕吉　山坟吉<br />
      交易未成　失物难寻　六畜损　` //仙机
    }
  },
  {
    name: '第二十签',
    qianXiang: { //签像
      xiongJi: '中签辰宫',//凶吉
      dianGu: '姜太公遇文王',//典故
      qianShi: `
      当春久雨喜开晴 玉兔金乌渐渐明 <br />
      旧事消散新事遂 看看一跳过龙门
      `,//签诗
      shiYi: '此卦久雨初明之象 凡事遂意也'//诗意
    },
    dianGu: {
      title: '姜太公遇文王', //标题
      detail: `周。姜尚。字子牙。汲人(东海许州人)。道号飞熊。先世封于吕。亦曰吕望。避纣乱居东海之滨。钓于磻溪(渭水)。其钩为直。意不在鱼。志在君相。文王闻其贤。聘为师(丞相)(其时年八十)。后周伐纣。灭商兴周。武王称曰尚父。封其子丁公于齐。` //内容
    },
    yunChen: {
      jieYue: `
      神佛护持 有灾无危     <br />
      途生平安 到底荣归`, //解曰
      xianJi: `家宅中平　婚姻随意　行人阻　公讼和<br />
      自身祈福　疾病禳星　田蚕阻　移徙吉<br />
      求财未遇　山坟旧吉　六畜阻　失物见<br />
      交易待时　六甲女　寻人迟　` //仙机
    }
  },
  {
    name: '第二十一签',
    qianXiang: { //签像
      xiongJi: '上签辰宫',//凶吉
      dianGu: '李旦龙凤配合',//典故
      qianShi: `
      阴阳道合总由天 女嫁男婚喜偎然 <br />
      但见龙蛇相会合 熏熏入梦喜团圆
      `,//签诗
      shiYi: '此卦阴阳道合之象，凡事和合大吉也'//诗意
    },
    dianGu: {
      title: '李旦龙凤配合', //标题
      detail: `李旦龙凤配合。李旦为唐睿宗。武则天登基。皇帝贬作平民。流落乡间。巧与胡凤姣相遇。结为夫妇。民间传说他们二人手上各有半个从胎带取出的方印。经斗印证明他们能合一。龙指睿宗。喻婚姻由天也。` //内容
    },
    yunChen: {
      jieYue: `
      谋望从心 婚姻孕男      <br />
      资财进益 更利田蚕`, //解曰
      xianJi: `疾病遇良方　山坟大吉　交易成　田蚕兴<br />
      公讼有理　家宅安　婚姻合　六畜兴<br />
      移徙昌盛　自身利　六甲男　寻人见<br />
      失物得见　求财有　行人至　` //仙机
    }
  },
  {
    name: '第二十二签',
    qianXiang: { //签像
      xiongJi: '中签巳宫',//凶吉
      dianGu: '六郎逢救',//典故
      qianShi: `
      旱时田里皆枯槁 谢天甘雨落淋淋 <br />
      花果草木皆润泽 始知一雨值千金
      `,//签诗
      shiYi: '此卦旱逢甘雨之象 凡事难中有救也'//诗意
    },
    dianGu: {
      title: '六郎逢救', //标题
      detail: `杨延昭为杨业之六子。称六郎。杨业统率三军。被番邦围困。杨业头撞李陵碑而亡。杨七郎讨救兵被箭射死。六郎撤退至葫芦谷。得五台山和尚(杨五郎)相救出险。喻及时雨也。` //内容
    },
    yunChen: {
      jieYue: `
      田蚕倍熟 命运渐来       <br />
      病遇良药 行人便回`, //解曰
      xianJi: `家宅祈保　失物西方　交易迟　六畜利<br />
      求财颇有　疾病殁送　婚姻合　寻人难<br />
      行人有阻　山坟安吉　六甲女　公讼亏<br />
      移徙守旧　自身安　田蚕利　` //仙机
    }
  }
]
